export const ERROR_MESSAGES = {
  REQUIRED: 'Это поле обязательно для заполнения.',
  INVALID_EMAIL: 'Некорректный адрес электронной почты',
  INVALID_PASSWORD:
    'Пароль должен содержать не менее 5-ти символов. (1 заглавная, строчная буквы, специальный символ, и цифру)',
  FOUNDED_USER: 'Пользователь с указанным адресом электронной почты уже существует',
  NOT_FOUND_USER: 'Пользователь с указанным адресом электронной почты найден не был.',
  PASSWORDS_MISMATCH: 'Пароли не совпадают.',
  SERVER_ERROR: 'Ошибка сервера.',
  NOT_EXIST_USER: 'Пользователя с таким email не существует.',
  INVALID_RECOVERY_CODE: 'Код восстановления не действителен.',
  INVALID_NAME: 'Поле может содержать только слова',
  INVALID_FUTURE_DATE: 'Не может содержать будущую дату.',
  ONLY_NUMBERS_PATTERN: 'Поле должно содержать только цифры',
  PATTERN_SYMBOLS: 'Поле не должно содержать символы',
};
